In [2]:
import numpy as np#จัดการตัวเลขarray

In [3]:
import pandas as pd
import yfinance
from matplotlib import pyplot as plt

In [4]:
import talib
import pandas_datareader as web
import datetime

In [5]:
data=pd.read_csv('ss.csv')#เลือกหุ้น
set_rsi=58
x=data
x

       Name  rsi  Ema
0        2S  NaN  NaN
1    3K-BAT  NaN  NaN
2       7UP  NaN  NaN
3         A  NaN  NaN
4        A5  NaN  NaN
..      ...  ...  ...
748     YCI  NaN  NaN
749     YGG  NaN  NaN
750   YUASA  NaN  NaN
751     ZEN  NaN  NaN
752    ZIGA  NaN  NaN

[753 rows x 3 columns]

In [6]:
b=0
a=data.iloc[0:,1:2]
a

     rsi
0    NaN
1    NaN
2    NaN
3    NaN
4    NaN
..   ...
748  NaN
749  NaN
750  NaN
751  NaN
752  NaN

[753 rows x 1 columns]

In [7]:
stock_rsi=a.iloc[b,0]
stock_rsi

nan

In [8]:
i=0
y=x.iloc[i,0]
y

'2S'

In [9]:
from datetime import datetime
from datetime import timedelta
now = datetime.today()
duration= timedelta(days=300)
start=now-duration

In [10]:

s = yfinance.download(y+".BK",start,now)
rsi = talib.RSI(s["Close"])
rsi

[*********************100%***********************]  1 of 1 completed

Date
2020-09-23          NaN
2020-09-24          NaN
2020-09-25          NaN
2020-09-28          NaN
2020-09-29          NaN
                ...
2021-07-13    42.021211
2021-07-14    45.081355
2021-07-15    50.687316
2021-07-16    53.256538
2021-07-19    45.583620
Length: 197, dtype: float64

In [11]:
print_rsi=rsi[-1]
stock_rsi=print_rsi
stock_rsi

45.58362014539543

In [12]:
#x=data
if stock_rsi<set_rsi:
   x = x.drop(0, axis=0)
   x.reset_index(drop=True) # Reset index
x

       Name  rsi  Ema
1    3K-BAT  NaN  NaN
2       7UP  NaN  NaN
3         A  NaN  NaN
4        A5  NaN  NaN
5       AAV  NaN  NaN
..      ...  ...  ...
748     YCI  NaN  NaN
749     YGG  NaN  NaN
750   YUASA  NaN  NaN
751     ZEN  NaN  NaN
752    ZIGA  NaN  NaN

[752 rows x 3 columns]

In [13]:
#Ema

In [14]:
c=0
d=data.iloc[1:,2:3]
d

     Ema
1    NaN
2    NaN
3    NaN
4    NaN
5    NaN
..   ...
748  NaN
749  NaN
750  NaN
751  NaN
752  NaN

[752 rows x 1 columns]

In [15]:
stock_ema=d.iloc[c,0] #first stock in ema
stock_ema

nan

In [39]:
end = datetime.today()
duration= timedelta(days=365)
start=now-duration
y

'2S'

In [37]:
df = web.DataReader(y+".BK", 'yahoo', start, end)
df

             High    Low   Open  Close    Volume  Adj Close
Date
2020-07-20  2.484  2.412  2.484  2.430  350777.0   2.326154
2020-07-21  2.466  2.430  2.430  2.448  267888.0   2.343385
2020-07-22  2.502  2.376  2.502  2.412  302222.0   2.308923
2020-07-23  2.448  2.394  2.412  2.412  151555.0   2.308923
2020-07-24  2.412  2.394  2.412  2.394  231111.0   2.291692
...           ...    ...    ...    ...       ...        ...
2021-07-14  5.700  5.600  5.600  5.700  224600.0   5.700000
2021-07-15  5.800  5.700  5.700  5.800  232400.0   5.800000
2021-07-16  5.850  5.700  5.850  5.850  230200.0   5.850000
2021-07-19  5.800  5.650  5.650  5.700  318000.0   5.700000
2021-07-20  5.800  5.650  5.750  5.700  146100.0   5.700000

[236 rows x 6 columns]

In [38]:
close_array=df.iloc[0:,3:-2]
close_array

            Close
Date
2020-07-20  2.430
2020-07-21  2.448
2020-07-22  2.412
2020-07-23  2.412
2020-07-24  2.394
...           ...
2021-07-14  5.700
2021-07-15  5.800
2021-07-16  5.850
2021-07-19  5.700
2021-07-20  5.700

[236 rows x 1 columns]

In [19]:
#df.to_csv('stock_prices_volumes.csv')

In [20]:
#close_array1=close_array.values.ravel()
#close_array1

In [21]:
close_array['EMA'] = talib.EMA(close_array['Close'], timeperiod =20)

In [22]:
close_array

            Close       EMA
Date
2020-07-20  2.430       NaN
2020-07-21  2.448       NaN
2020-07-22  2.412       NaN
2020-07-23  2.412       NaN
2020-07-24  2.394       NaN
...           ...       ...
2021-07-13  5.650  5.778293
2021-07-14  5.700  5.770837
2021-07-15  5.800  5.773614
2021-07-16  5.850  5.780889
2021-07-19  5.700  5.773185

[239 rows x 2 columns]

In [35]:
close_data = close_array.iloc[-1,0]
close_data

5.699999809265137

In [24]:
ema_data0 =close_array.iloc[-1,1]
ema_data0

5.773185342501607

In [25]:
#emadata50

In [26]:
close_array['EMA'] = talib.EMA(close_array['Close'], timeperiod =50)

In [27]:
close_array

            Close       EMA
Date
2020-07-20  2.430       NaN
2020-07-21  2.448       NaN
2020-07-22  2.412       NaN
2020-07-23  2.412       NaN
2020-07-24  2.394       NaN
...           ...       ...
2021-07-13  5.650  5.739148
2021-07-14  5.700  5.737613
2021-07-15  5.800  5.740059
2021-07-16  5.850  5.744371
2021-07-19  5.700  5.742631

[239 rows x 2 columns]

In [28]:
ema_data1 =close_array.iloc[-1,1]
ema_data1

5.7426308073541295

In [29]:
close_array['EMA'] = talib.EMA(close_array['Close'], timeperiod =200)
close_array

            Close       EMA
Date
2020-07-20  2.430       NaN
2020-07-21  2.448       NaN
2020-07-22  2.412       NaN
2020-07-23  2.412       NaN
2020-07-24  2.394       NaN
...           ...       ...
2021-07-13  5.650  4.446960
2021-07-14  5.700  4.459428
2021-07-15  5.800  4.472767
2021-07-16  5.850  4.486471
2021-07-19  5.700  4.498546

[239 rows x 2 columns]

In [30]:
ema_data2 =close_array.iloc[-1,1]
ema_data2

4.498546009836144

In [31]:
#filter check rsi and ema

In [32]:
#check close ema > close ema (timeperiod)

In [33]:
if close_data>

SyntaxError: invalid syntax (<ipython-input-33-c8dd07fb2a5f>, line 1)